Cypherock/x1_wallet_hal_stm32/BSP/board.c

#include <stdio.h>
#include "board.h"
#include "stm32l4xx_hal.h"
#include "sdk_config.h"
#include "libusb.h"

UART_HandleTypeDef hlpuart1;
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;
RNG_HandleTypeDef hrng;

uint32_t joystick_pressed = 0xff;
uint32_t buzzer_counter=0, bsp_tick=0;
atecc_interface_type atecc_mode=0; 
#define LPUART_TIMEOUT	5

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
	  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
	  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
	  SCB->VTOR = FIRMWARE_START_ADDRESS;
	  /** Initializes the RCC Oscillators according to the specified parameters
	  * in the RCC_OscInitTypeDef structure.
	  */
	  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
	  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	  RCC_OscInitStruct.MSICalibrationValue = 0;
	  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
	  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
	  RCC_OscInitStruct.PLL.PLLM = 1;
	  RCC_OscInitStruct.PLL.PLLN = 40;
	  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
	  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
	  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
	  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Initializes the CPU, AHB and APB buses clocks
	  */
	  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
	                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_I2C2|RCC_PERIPHCLK_I2C3
	                              |RCC_PERIPHCLK_USB;
	  PeriphClkInit.I2c2ClockSelection = RCC_I2C2CLKSOURCE_PCLK1;
	  PeriphClkInit.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
	  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLLSAI1;
	  PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
	  PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
	  PeriphClkInit.PLLSAI1.PLLSAI1N = 24;
	  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
	  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
	  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
	  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK;
	  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Configure the main internal regulator output voltage
	  */
	  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
	  {
	    Error_Handler();
	  }

	  HAL_PWR_EnableBkUpAccess();
}

void BSP_USB_Clock_Init(){
    HAL_PWR_EnableBkUpAccess();

    /* Enable Power Clock*/
    __HAL_RCC_PWR_CLK_ENABLE();

    /* Enable USB power on Pwrctrl CR2 register */
    HAL_PWREx_EnableVddUSB();
}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
void BSP_LPUART1_UART_Init(uint32_t baudrate)
{

  /* USER CODE BEGIN USART3_Init 0 */
  HAL_UART_DeInit(&hlpuart1);
  /* USER CODE END USART3_Init 0 */

  /* USER CODE BEGIN USART3_Init 1 */

  /* USER CODE END USART3_Init 1 */
  hlpuart1.Instance = LPUART1;
  hlpuart1.Init.BaudRate = baudrate;
  hlpuart1.Init.WordLength = UART_WORDLENGTH_7B;
  hlpuart1.Init.StopBits = UART_STOPBITS_1;
  hlpuart1.Init.Parity = UART_PARITY_NONE;
  hlpuart1.Init.Mode = UART_MODE_TX_RX;
  hlpuart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  hlpuart1.Init.OverSampling = UART_OVERSAMPLING_16;
  hlpuart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  hlpuart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_HalfDuplex_Init(&hlpuart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART3_Init 2 */
	HAL_UART_EnableReceiverTimeout(&hlpuart1);
	HAL_UART_ReceiverTimeout_Config(&hlpuart1, 24);
  /* USER CODE END USART3_Init 2 */

}

void BSP_LPUART1_UART_DeInit(){
	HAL_UART_DeInit(&hlpuart1);
}

uint8_t BSP_LPUART1_UART_Write(uint8_t* data, uint16_t size){
	bsp_tick = LPUART_TIMEOUT;

    while(!(hlpuart1.Instance->ISR & UART_FLAG_TXE)) {
        // wait for tx empty
        if(bsp_tick == 0)
			return 1;
    }
    hlpuart1.Instance->TDR = *data;
	return 0;
}

uint8_t BSP_LPUART1_UART_ClearReadBuff(){
	//set timeout value
    bsp_tick = LPUART_TIMEOUT;

    while(!(hlpuart1.Instance->ISR & UART_FLAG_TC)) {
        //wait for transmission complete
		if(bsp_tick == 0){
			break;
		}
    }

    // clear rx buffer
    hlpuart1.Instance->RQR = USART_RQR_RXFRQ;

    // clear overrun error
    // clear rx timeout flag
    // clear framing error
    hlpuart1.Instance->ICR = USART_ICR_ORECF | USART_ICR_RTOCF | USART_ICR_FECF;
}


uint8_t BSP_LPUART1_UART_Read(uint8_t* data, uint16_t size){
	//set timeout value
    bsp_tick = LPUART_TIMEOUT;

    while(bsp_tick != 0) {
		if(hlpuart1.Instance->ISR & UART_FLAG_RXNE) {
			*data = hlpuart1.Instance->RDR & 0x7f;
			return 0;
		}
		if(hlpuart1.Instance->ISR & UART_FLAG_RTOF) {
			return hlpuart1.Instance->ICR = USART_ICR_RTOCF;
		}
    }

    return 1;
}



/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
void BSP_I2C1_Init(void)
{
	  hi2c1.Instance = BSP_PN532_OLED_I2C;
	  hi2c1.Init.Timing = BSP_PN532_OLED_I2C_SPEED;
	  hi2c1.Init.OwnAddress1 = 0x3F;
	  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	  hi2c1.Init.OwnAddress2 = 0xFF;
	  hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Configure Analogue filter
	  */
	  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Configure Digital filter
	  */
	  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
	  {
	    Error_Handler();
	  }



