Cypherock/x1_wallet_hal_stm32/BSP/board.c
	  /* USER CODE BEGIN I2C2_Init 0 */

	  /* USER CODE END I2C2_Init 0 */

	  /* USER CODE BEGIN I2C2_Init 1 */

	  /* USER CODE BEGIN I2C2_Init 2 */

	  /* USER CODE END I2C2_Init 2 */

}


uint8_t BSP_I2C1_IO_Write(uint16_t devAddress, uint8_t *pData , uint8_t size)
{
	/* TODO: Add error handling for i2c transactions */
	return HAL_I2C_Master_Transmit(&hi2c1, devAddress, pData, size, 1000);
}

uint8_t BSP_I2C1_IO_Read(uint16_t devAddress, uint8_t *pData , uint8_t size)
{
	/* TODO: Add error handling for i2c transactions */
	return HAL_I2C_Master_Receive(&hi2c1, devAddress, pData, size, 100);
}

void BSP_I2C1_IO_Read_MEM(uint16_t devAddress, uint16_t memAddress, uint8_t *pData , uint8_t size)
{
	/* TODO: Add error handling for i2c transactions */
	return HAL_I2C_Mem_Read(&hi2c1, devAddress, memAddress, I2C_MEMADD_SIZE_8BIT, pData, size, 1000);
}

void BSP_I2C1_AddressScan(void)
{
	HAL_StatusTypeDef result;
	uint8_t i;
	for (i=1; i<128; i++)
	{
	  /*
	   * the HAL wants a left aligned i2c address
	   * &hi2c1 is the handle
	   * (uint16_t)(i<<1) is the i2c address left aligned
	   * retries 2
	   * timeout 2
	   */
	  result = HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(i<<1), 2, 2);
	  if (result == HAL_OK)
	  {
		  if(i==0x24 || i==0x3c){
			  BSP_TIM2_PWM_Start(200);
			  BSP_DelayMs(1000);
		  }
	  }
	}
}

/**
  * @brief I2C2 Initialization Function
  * @param timing   for selecting I2C speed standard or fast
  *                 standard:-  BSP_ATECC_I2C_MODE_STANDARD
  *                 fast:-      BSP_ATECC_I2C_MODE_FAST
  * @retval None
  */
void BSP_I2C2_Init(uint32_t timing)
{
	  /* USER CODE BEGIN I2C2_Init 0 */
	  if (HAL_I2C_DeInit(&hi2c2) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /* USER CODE END I2C3_Init 0 */

	  /* USER CODE BEGIN I2C3_Init 1 */

	  /* USER CODE END I2C3_Init 1 */
	  hi2c2.Instance = BSP_ATECC_I2C;
	  hi2c2.Init.Timing = timing;
	  hi2c2.Init.OwnAddress1 = 0x3F;
	  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	  hi2c2.Init.OwnAddress2 = 0xFF;
	  hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	  if (HAL_I2C_Init(&hi2c2) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Configure Analogue filter
	  */
	  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c2, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /** Configure Digital filter
	  */
	  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c2, 0) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /* USER CODE BEGIN I2C3_Init 2 */

	  /* USER CODE END I2C3_Init 2 */

}

void BSP_I2C2_DeInit(){
	if (HAL_I2C_DeInit(&hi2c2) != HAL_OK)
	{
		Error_Handler();
	}
}

uint8_t BSP_I2C2_IO_Write(uint16_t devAddress, uint8_t *pData , uint8_t size)
{
	/* TODO: Add error handling for i2c transactions */
	return HAL_I2C_Master_Transmit(&hi2c2, devAddress, pData, size, 1000);
}

uint8_t BSP_I2C2_IO_Read(uint16_t devAddress, uint8_t *pData , uint8_t size)
{
	/* TODO: Add error handling for i2c transactions */
	return HAL_I2C_Master_Receive(&hi2c2, devAddress, pData, size, 100);
}

void BSP_I2C2_AddressScan(void)
{
	HAL_StatusTypeDef result;
	uint8_t i;
	for (i=1; i<128; i++)
	{
	  /*
	   * the HAL wants a left aligned i2c address
	   * &hi2c2 is the handle
	   * (uint16_t)(i<<1) is the i2c address left aligned
	   * retries 2
	   * timeout 2
	   */
	  result = HAL_I2C_IsDeviceReady(&hi2c2, (uint16_t)(i<<1), 2, 2);
	  if (result == HAL_OK)
	  {
		  if(i==0x60){
			  BSP_TIM2_PWM_Start(100);
			  BSP_DelayMs(500);
		  }
	  }
	}
}

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
void BSP_TIM2_Init(void)
{

	  /* USER CODE BEGIN TIM2_Init 0 */

	  /* USER CODE END TIM2_Init 0 */

	  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
	  TIM_MasterConfigTypeDef sMasterConfig = {0};
	  TIM_OC_InitTypeDef sConfigOC = {0};

	  /* USER CODE BEGIN TIM2_Init 1 */

	  /* USER CODE END TIM2_Init 1 */
	  htim2.Instance = BSP_BUZZER_TIMER;
	  htim2.Init.Prescaler = BSP_BUZZER_TIMER_PRESCALAR;
	  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
	  htim2.Init.Period = BSP_BUZZER_TIMER_PERIOD;
	  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
	  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  if (HAL_TIM_PWM_Init(&htim2) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
	  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sConfigOC.OCMode = TIM_OCMODE_PWM1;
	  sConfigOC.Pulse = BSP_BUZZER_TIMER_COUNTER;
	  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
	  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
	  if (HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, BSP_BUZZER_PWM_CHANNEL) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /* USER CODE BEGIN TIM2_Init 2 */

	  /* USER CODE END TIM2_Init 2 */
	  HAL_TIM_MspPostInit(&htim2);

}

void BSP_TIM3_Base_Start_IT()
{
    HAL_TIM_Base_Start_IT(&htim3);
}


/**
  * @brief TIM3 Initialization Function
  * @param None
  * @retval None
  */
void BSP_TIM3_Init(void)
{

  /* USER CODE BEGIN TIM3_Init 0 */

  /* USER CODE END TIM3_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM3_Init 1 */

  /* USER CODE END TIM3_Init 1 */
  htim3.Instance = TIM3;
  htim3.Init.Prescaler = 7999;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 9999;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim3) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM3_Init 2 */

  /* USER CODE END TIM3_Init 2 */

