Cypherock/x1_wallet_hal_stm32/BSP/board.c
}

void BSP_TIM6_Init(void)
{

	  /* USER CODE BEGIN TIM6_Init 0 */

	  /* USER CODE END TIM6_Init 0 */

	  TIM_MasterConfigTypeDef sMasterConfig = {0};

	  /* USER CODE BEGIN TIM6_Init 1 */

	  /* USER CODE END TIM6_Init 1 */
	  htim6.Instance = TIM6;
	  htim6.Init.Prescaler = 0;
	  htim6.Init.CounterMode = TIM_COUNTERMODE_UP;
	  htim6.Init.Period = 79;
	  htim6.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	  if (HAL_TIM_Base_Init(&htim6) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
	  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	  if (HAL_TIMEx_MasterConfigSynchronization(&htim6, &sMasterConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  /* USER CODE BEGIN TIM6_Init 2 */
	  HAL_TIM_Base_Stop(&htim6);
	  /* USER CODE END TIM6_Init 2 */

}


uint32_t delay_us_counter=0;
void BSP_DelayCounterDec()
{
	if (__HAL_TIM_GET_FLAG(&htim6, TIM_FLAG_UPDATE) != RESET)
	{
		if (__HAL_TIM_GET_IT_SOURCE(&htim6, TIM_IT_UPDATE) != RESET)
		{
			__HAL_TIM_CLEAR_IT(&htim6, TIM_IT_UPDATE);
			if (delay_us_counter)
			{
			    delay_us_counter--;
			}
		}
	}
}

void BSP_DelayUs(uint32_t delay)
{
	delay_us_counter=delay;
	HAL_TIM_Base_Start(&htim6);
	do{
		if(__HAL_TIM_GET_FLAG(&htim6, TIM_FLAG_UPDATE) != RESET)
			delay_us_counter--;
	}while(delay_us_counter != 0);
	HAL_TIM_Base_Stop(&htim6);

}

void BSP_TIM2_PWM_Start(uint32_t buzzer_on_time)
{
	buzzer_counter=buzzer_on_time;
    HAL_TIM_PWM_Start(&htim2, BSP_BUZZER_PWM_CHANNEL);
}

void BSP_TIM2_PWM_Stop(void)
{
    HAL_TIM_PWM_Stop(&htim2, BSP_BUZZER_PWM_CHANNEL);
}
/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
void BSP_GPIO_Init(uint32_t hardware_version)
{

	  GPIO_InitTypeDef GPIO_InitStruct = {0};

	  /* GPIO Ports Clock Enable */
	  __HAL_RCC_GPIOC_CLK_ENABLE();
	  __HAL_RCC_GPIOA_CLK_ENABLE();
	  __HAL_RCC_GPIOB_CLK_ENABLE();

	  if(hardware_version == 0){
		  hardware_version = DEVICE_HARDWARE_STM32_3;
	  }

	  /*Configure GPIO pins : PC4 PC5 PC6 PC7
	                           PC8 */
	  GPIO_InitStruct.Pin = BSP_JOYSTICK_UP_PIN|BSP_JOYSTICK_DOWN_PIN|BSP_JOYSTICK_RIGHT_PIN|BSP_JOYSTICK_LEFT_PIN
	                          |BSP_JOYSTICK_ENTER_PIN;
	  GPIO_InitStruct.Mode = BSP_JOYSTICK_GPIO_MODE(hardware_version);
	  GPIO_InitStruct.Pull = BSP_JOYSTICK_GPIO_PULL(hardware_version);
	  HAL_GPIO_Init(BSP_JOYSTICK_GPIO_PORT, &GPIO_InitStruct);
	  joystick_pressed = BSP_JOYSTICK_READ_STATE(hardware_version);

	  /*Configure GPIO pins : PB4 PB5 */
	  GPIO_InitStruct.Pin = BSP_PN532_RST_PIN|BSP_PN532_INT_PIN;
	  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  HAL_GPIO_Init(BSP_PN532_RST_PORT, &GPIO_InitStruct);

	  /* EXTI interrupt init*/
	  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
	  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

	  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
	  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);


    // USB
    /* Configure DM DP Pins */
    GPIO_InitStruct.Pin = (GPIO_PIN_11 | GPIO_PIN_12);
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Configure VBUS Pin */
    GPIO_InitStruct.Pin = GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    /* Enable USB FS Clock */
    __HAL_RCC_USB_OTG_FS_CLK_ENABLE();

    // Enable VBUS sense (B device) via pin PA9
    USB_OTG_FS->GCCFG &= ~USB_OTG_GCCFG_VBDEN;

    USB_OTG_FS->GUSBCFG &= ~USB_OTG_GUSBCFG_FHMOD;
    USB_OTG_FS->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;

    USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
    USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;
	}

uint32_t Key_Pressed = 0;
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
//	BSP_TIM2_PWM_Start(100);
	if (GPIO_Pin == BSP_JOYSTICK_UP_PIN)
	{
		Key_Pressed = 1;//up
	}
	else if (GPIO_Pin == BSP_JOYSTICK_DOWN_PIN)
	{
		Key_Pressed = 2;//down
	}
	else if (GPIO_Pin == BSP_JOYSTICK_RIGHT_PIN)
	{
		Key_Pressed = 4;//right
	}
	else if (GPIO_Pin == BSP_JOYSTICK_LEFT_PIN)
	{
		Key_Pressed = 3;//left
	}
	else if (GPIO_Pin == BSP_JOYSTICK_ENTER_PIN)
	{
		Key_Pressed = 5;//ok
	}
}

uint32_t BSP_GetKeyPressed(void)
{
  return Key_Pressed;
}

void BSP_ClearKeyPressed(void)
{
  Key_Pressed = 0;;
}

uint32_t disp_error_check(uint32_t ret){
  if(ret != HAL_OK){
    while (1)
    {
      BSP_TIM2_PWM_Start(50);
      BSP_DelayMs(100);
      BSP_TIM2_PWM_Start(50);
      BSP_DelayMs(2800);
    }
  }
}

/**
  * @brief  Gets the page of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The page of a given address
  */
static uint32_t GetPage(uint32_t Addr)
{
  uint32_t page = 0;

  if (Addr < (FLASH_BASE + FLASH_BANK_SIZE))
  {
    /* Bank 1 */
    page = (Addr - FLASH_BASE) / FLASH_PAGE_SIZE;
  }
  else
  {
    /* Bank 2 */
    page = (Addr - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_PAGE_SIZE;
  }

  return page;
}

/**
  * @brief  Gets the bank of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The bank of a given address
  */
static uint32_t GetBank(uint32_t Addr)
{
      uint32_t bank = 0;

      if (READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE) == 0)
      {
        /* No Bank swap */
        if (Addr < (FLASH_BASE + FLASH_BANK_SIZE))
        {
          bank = FLASH_BANK_1;
        }
        else
        {
          bank = FLASH_BANK_2;
        }
      }
      else
      {
        /* Bank swap */
        if (Addr < (FLASH_BASE + FLASH_BANK_SIZE))
        {
          bank = FLASH_BANK_2;
        }
        else
        {
          bank = FLASH_BANK_1;
        }
      }

      return bank;
}
/**
  * Read word from Non-Volatile memory
  */
void BSP_NonVolatileRead(uint32_t addr, uint32_t *dstAddr, uint32_t numOfbytes)
{
    uint32_t* sourceAddr = (uint32_t *)addr;
    uint8_t offset = numOfbytes%4;
    uint32_t numOfWords = numOfbytes/4;

