Cypherock/x1_wallet_hal_stm32/BSP/board.c
    for (int i=0; i < numOfWords; i++) {
        *dstAddr = ((uint32_t)(*sourceAddr));
        dstAddr++;
        sourceAddr++;
    }

    if(offset){
        uint32_t word = ((uint32_t)(*sourceAddr));
        *dstAddr = *dstAddr & (0xFFFFFFFF<<((offset)*8));
        word = word & (0xFFFFFFFF>>((4-offset)*8));
        *dstAddr = *dstAddr | word;
    }
}

BSP_Status_t BSP_FlashSectorErase(uint32_t page_address, uint32_t noOfpages)
{
    FLASH_EraseInitTypeDef ptEraseTypeInfo;
    uint32_t sectorError;
    BSP_Status_t status = BSP_OK;
    uint32_t noOfpages_erased=0;
    ptEraseTypeInfo.Banks = GetBank(page_address);
    ptEraseTypeInfo.TypeErase = FLASH_TYPEERASE_PAGES;
    ptEraseTypeInfo.Page = GetPage(page_address);

    if((ptEraseTypeInfo.Page + noOfpages) > FLASH_BANK_SIZE/FLASH_PAGE_SIZE){
        noOfpages_erased = ptEraseTypeInfo.NbPages = (FLASH_BANK_SIZE/FLASH_PAGE_SIZE)-ptEraseTypeInfo.Page;
    }
    else{
        noOfpages_erased = ptEraseTypeInfo.NbPages = noOfpages;
    }
    HAL_FLASH_Unlock();
    if (HAL_FLASHEx_Erase(&ptEraseTypeInfo, &sectorError) != HAL_OK)
        status = BSP_FLASH_ERR;

    if((noOfpages_erased<noOfpages)&&(ptEraseTypeInfo.Banks==1)){
        ptEraseTypeInfo.Banks = 2;
        ptEraseTypeInfo.TypeErase = FLASH_TYPEERASE_PAGES;
        ptEraseTypeInfo.Page = FLASH_BASE+FLASH_BANK_SIZE;//GetPage(page_address);
        ptEraseTypeInfo.NbPages = noOfpages-noOfpages_erased;
        if (HAL_FLASHEx_Erase(&ptEraseTypeInfo, &sectorError) != HAL_OK)
            status = BSP_FLASH_ERR;
    }
    HAL_FLASH_Lock();

    return status;
}

BSP_Status_t BSP_FlashSectorWrite(__IO uint32_t *dstAddr, const uint32_t* srcAddr, uint32_t noOfbytes)
{
	int i;
    BSP_Status_t status = BSP_OK;
    uint64_t *p64Data = (uint64_t*)srcAddr;
	uint32_t noOfWords = (noOfbytes>>3)<<1;

    if((*dstAddr < FLASH_BASE) || ((*dstAddr + noOfbytes) > FLASH_END))
        return status;

    HAL_FLASH_Unlock();
    for (i = 0; i < noOfWords; i+=2) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, (uint32_t)(dstAddr), *p64Data) == HAL_OK) {
            if (*p64Data != *(uint64_t*)dstAddr) {
                status = BSP_FLASH_ERR;
                break;
            }
            dstAddr+=2;
            p64Data++;
        }
        else
            status = BSP_FLASH_ERR;
    }

	if(noOfbytes%8 != 0){
		uint8_t	padding = 8-(noOfbytes%8);
		uint64_t u64Data=0;

		if(padding < 4){
			u64Data = srcAddr[1] | (0xFFFFFFFF<<((4-padding)*8));
			u64Data = u64Data<<32;
			u64Data |= srcAddr[0];
		}
		else{
			u64Data = (uint64_t)0xFFFFFFFF << 32;
			u64Data |= srcAddr[0] | (0xFFFFFFFF<<((8-padding)*8));
		}
		if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, (uint32_t)(dstAddr), u64Data) == HAL_OK) {
			if (u64Data != *(uint64_t*)dstAddr) {
				status = 1;
			}
		}
	}

    HAL_FLASH_Lock();
    return status;
}

void BSP_reset(void)
{
	HAL_NVIC_SystemReset();
}

void BSP_DelayMs(uint32_t delayValue)
{
	HAL_Delay(delayValue);
}

void BSP_Buzzer_Timer(){
	if(buzzer_counter!=0){
		buzzer_counter--;
		if(buzzer_counter==0){
			BSP_TIM2_PWM_Stop();
		}
	}
}

void BSP_RNG_Init(void)
{
/********************  Bits definition for RNG_CR Clock Error detection register  *******************/
#define RNG_CR_CED_Pos    (5U)
#define RNG_CR_CED_Msk    (0x1UL << RNG_CR_RNGEN_Pos)                        /*!< 0x00000004 */
#define RNG_CR_CED        RNG_CR_RNGEN_Msk

  /* USER CODE BEGIN RNG_Init 0 */

  /* USER CODE END RNG_Init 0 */

  /* USER CODE BEGIN RNG_Init 1 */

  /* USER CODE END RNG_Init 1 */

  BSP_RNG_End();    //disable RNG if already started

  __HAL_RCC_RNG_CLK_ENABLE();                   //Enable RNG clock
  CLEAR_BIT(RNG->SR, RNG_IT_CEI|RNG_IT_SEI);    //Clear RNG Interrupt status bits
  SET_BIT(RNG->CR, RNG_CR_CED);                 //Enable Clock Error detection
  SET_BIT(RNG->CR, RNG_CR_RNGEN);               //Enable RNG

  //Check if any error has occured in RNG Clock or random generation
  if(HAL_IS_BIT_SET(RNG->SR, RNG_IT_SEI) || HAL_IS_BIT_SET(RNG->SR, RNG_IT_CEI)){
    CLEAR_BIT(RNG->SR, RNG_IT_CEI|RNG_IT_SEI);
    Error_Handler();
  }

  uint32_t tickstart = HAL_GetTick();
  while (HAL_IS_BIT_CLR(RNG->SR, RNG_SR_DRDY)     //Is RNG data ready?
        || HAL_IS_BIT_SET(RNG->SR, RNG_SR_SECS)   //Is Seed error detected?
        || HAL_IS_BIT_SET(RNG->SR, RNG_SR_CECS))  //Is Clock error ongoing?
  {
    if ((HAL_GetTick() - tickstart) > 2)          //Taking too long?
    {
      Error_Handler();
    }
  }
  /* USER CODE BEGIN RNG_Init 2 */

  /* USER CODE END RNG_Init 2 */

}

BSP_Status_t BSP_RNG_Generate(uint32_t *random32bit) {
  //If RNG interrupt had occured, restart RNG
  if(HAL_IS_BIT_SET(RNG->SR, RNG_IT_SEI) || HAL_IS_BIT_SET(RNG->SR, RNG_IT_CEI)){
    BSP_RNG_Init();
  }

  uint32_t tickstart = HAL_GetTick();
  //Wait till RNG is ready and all issues are resolved
  while (HAL_IS_BIT_CLR(RNG->SR, RNG_SR_DRDY) || HAL_IS_BIT_SET(RNG->SR, RNG_SR_SECS) || HAL_IS_BIT_SET(RNG->SR, RNG_SR_CECS))
  {
    if ((HAL_GetTick() - tickstart) > 2)
    {
      return BSP_RNG_HW_ERROR;
    }
  }

  //Check if random data is zero
  if(RNG->DR != 0) {
    *random32bit = RNG->DR;
    return BSP_OK;
  }
  return BSP_RNG_ZERO_ERROR;
}

void BSP_RNG_End(void){
  __HAL_RCC_RNG_CLK_DISABLE();      //disable RNG clock
  CLEAR_BIT(RNG->CR, RNG_CR_RNGEN); //disable RNG
}


/* user callback function for systick Handler */
void HAL_SYSTICK_Callback(void)
{
	BSP_App_Timer_Run();
	BSP_Buzzer_Timer();
	if(bsp_tick != 0){
		bsp_tick--;
	}
}

BSP_App_Timer_Callback_t appTimerList[BSP_APP_TIMER_MAX];
static uint8_t appTimerRegisterCount = 0;
static uint32_t systickCounter = 0;

void BSP_App_Timer_Init()
{
  for (uint8_t count = 0; count < BSP_APP_TIMER_MAX; count++)
  {
	  appTimerList[count].appTimerCb   = NULL;
	  appTimerList[count].timeOutValue = 0;
  }
}

uint32_t BSP_App_Timer_Create(uint8_t TimerId, void appTimerHandler(void))
{
	if ((BSP_APP_TIMER_MAX > appTimerRegisterCount) && (NULL != appTimerHandler))
	{
		appTimerList[TimerId].appTimerCb   = appTimerHandler;
		appTimerList[TimerId].timeOutValue = 0;
		appTimerRegisterCount++;
		return 0;
	}
	else
	{
		return 1;
	}

