Cypherock/x1_wallet_hal_stm32/BSP/board.c
}

void BSP_App_Timer_Start(uint8_t TimerId, uint32_t timeOutValue)
{
	if ((appTimerRegisterCount > TimerId) && (NULL != appTimerList[TimerId].appTimerCb))
	{
		appTimerList[TimerId].timeOutValue = timeOutValue;
	}
}

void BSP_App_Timer_Stop(uint8_t TimerId)
{
	if ((appTimerRegisterCount > TimerId) && (NULL != appTimerList[TimerId].appTimerCb))
	{
		appTimerList[TimerId].timeOutValue = 0;
		appTimerList[TimerId].appTimerCb   = NULL;
	}
}

void BSP_App_Timer_Run(void)
{
	systickCounter++;

	for (uint8_t count = 0; count < appTimerRegisterCount; count++)
	{
//       if (appTimerList[count].timeOutValue >= systickCounter)
		if(appTimerList[count].timeOutValue==0){
			continue;
		}
		if((systickCounter+1)%(appTimerList[count].timeOutValue)==0)
       {
    	   if(NULL != appTimerList[count].appTimerCb)
    	   {
    	     appTimerList[count].appTimerCb();
    	   }
       }
	}
}

void BSP_DebugPort_Write(uint8_t * data, uint8_t size){
    lusb_write(data, size);
}


void BSP_sysClkDisable(void)
{
	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;
}

uint32_t read_hw_gpio_config()
{
	__HAL_RCC_GPIOC_CLK_ENABLE();
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = BSP_JOYSTICK_LEFT_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BSP_JOYSTICK_GPIO_PORT, &GPIO_InitStruct);

    if (HAL_GPIO_ReadPin(BSP_JOYSTICK_GPIO_PORT, BSP_JOYSTICK_LEFT_PIN) == GPIO_PIN_SET) {
        return DEVICE_HARDWARE_STM32_2;
    } else {
        return DEVICE_HARDWARE_STM32_3;
    }
}
